[
  {
    "Id": "837268",
    "ThreadId": "356030",
    "Html": "\r\n<p>My team is just about to start deploying Wolfpack in our organization and we found that the MsmqQueueNotEmpty check has the same TypeId as the MsmqQueueInfo check. It's my understanding that each check needs to have its own type id. Is there a reason they\r\n have the same Type Id or should they be different?</p>\r\n",
    "PostedDate": "2012-05-16T09:12:02.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "837313",
    "ThreadId": "356030",
    "Html": "<p>Hi..oops..thanks for spotting it - in reality the type id/guid doesn't&nbsp;matter as the theory of it was to be able to identify data from a&nbsp;specific check \"type\" (as opposed to a specific instance). Eg if you&nbsp;wanted to find EVERY result generated by the MSMQ queue empty check&nbsp;you could. I think the idea was to produce a universal directory of&nbsp;known \"check\" plugins...eg if you wanted to write a plugin that dealt&nbsp;with result messages generated from a particular check you could as&nbsp;the is a known constant.&nbsp;It was also more for performing analytics on the result data.</p>\r\n<p>The bottom line is a&nbsp;duplicate guid won't stop it working. I'll fix it in the source ASAP</p>\r\n<p><span>If you need any help rolling out Wolfpack please drop me a message -&nbsp;</span><span>happy to help if required.</span><br /><br /><span>Cheers,</span><br /><span>James</span></p>",
    "PostedDate": "2012-05-16T10:28:42.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "837388",
    "ThreadId": "356030",
    "Html": "<p>Thanks for your quick reply. I was aware that the type id is designed to differentiate between check types not instances of checks. The reason I asked was because my team is building a basic dashboard view that will show the current status of each of the checks grouped by the type so that we can display different metrics based on the type.&nbsp;</p>",
    "PostedDate": "2012-05-16T13:08:20.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "837527",
    "ThreadId": "356030",
    "Html": "<p>ok, cool....the dashboard view sounds interesting. There have been a number of enquiries about WP including a dashboard view of it's own and so far I haven't had chance to tackle this further than sketching out some ideas using SignalR (as a self hosted WP Activity) to power some html5 pages. Would be great to see a screenshot of your dashboard when you get it up and running.</p>\r\n<p>Cheers,</p>\r\n<p>James</p>",
    "PostedDate": "2012-05-17T00:06:05.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "837530",
    "ThreadId": "356030",
    "Html": "<p>PS: The new GUID for MSMQ not empty check is:&nbsp;</p>\r\n<pre><span>51D9BEE6-F12A-447F-B255-28D00CDFBECB</span>\r\n</pre>",
    "PostedDate": "2012-05-17T00:09:22.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "838154",
    "ThreadId": "356030",
    "Html": "<p>Thanks, I'll try to remember to post a screen shot once we have something closer to finalization. We are using SignalR hosted in MVC3 pushing to a page using Backbone.Marionette for the views&nbsp;<a href=\"https://github.com/derickbailey/backbone.marionette\">https://github.com/derickbailey/backbone.marionette</a>. Our first phase is to have a simple overview of all of the various checks and their current state.</p>",
    "PostedDate": "2012-05-18T07:49:39.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]