[
  {
    "Id": "1302988",
    "ThreadId": "566924",
    "Html": "You had mentioned that this thread can be used as a V3 wishlist discussion.\r<br />\n<br />\nIt would be nice if I didn't have to rewrite my configuration files in order to use V3.  For me it would be a lot of machines and a lot of config files to update.  Is there any plan to make the old config files compatible with V3?  \r<br />\n",
    "PostedDate": "2014-09-09T12:26:07.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1302997",
    "ThreadId": "566924",
    "Html": "Sure I understand the pain replicating v2 configuration in v3.\r<br />\n<br />\nThe short answer is I <em>didn't</em> have any plans to fix that - however I am in the middle of changing the configuration file format again (simplifying it) and one of the things I thought about was a conversion tool....and also a plugin to replicate configuration to agents eg: remotely push some/all config from one agent to one or many other agents.\r<br />\n<br />\nA simple conversion tool from vX to vY could be created and I'll certainly take a look at that once I have the new config standard complete - so I would say if you are going to v3 wait until v3.1 is released with the new standard and hopefully I'll bundle a vX to v3.1 conversion tool with it. \r<br />\n<br />\nIdeas welcome for a quick/bulk/remote config push plugin as mentioned above!\r<br />\n<br />\nCheers,\r<br />\nJames<br />\n",
    "PostedDate": "2014-09-09T12:58:52.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1303008",
    "ThreadId": "566924",
    "Html": "I don't think the plugin to push would help.  The machines that I'm using will not allow a push mechanism that doesn't involve custom wsus packages. The machines are also not visible to each other.\r<br />\n<br />\nThank you for the quick reply.<br />\n\r<br />\nWolfpack is a great program!<br />\n",
    "PostedDate": "2014-09-09T13:40:46.573-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1303016",
    "ThreadId": "566924",
    "Html": "Ok, sure - makes sense that machines are not visible. If it makes any difference the plugin would operate http over port 80 (or whatever port you wanted).\r<br />\n<br />\nSo - a simple upgrade/conversion tool bundled with Wolfpack would do the job it sounds like to solve the immediate requirement. I'll add it to the TODO list!\r<br />\n<br />\nThanks!\r<br />\nJames<br />\n",
    "PostedDate": "2014-09-09T14:04:44.113-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]