[
  {
    "Id": "1310362",
    "ThreadId": "568992",
    "Html": "Am I missing something, or is it impossible for a HealthCheck to access the RequiredProperties that it was configured with?\r<br />\n<br />\nI'm looking to add properties in the health check configuration, and I want to pass these in the notification generated by the health check.\r<br />\n<br />\nIs this possible, or is there a better alternative?<br />\n",
    "PostedDate": "2014-10-03T13:51:51.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1310447",
    "ThreadId": "568992",
    "Html": "Hi - the required properties really just allow the configuration UI/component to validate the config being saved. You will need to have properties on your config class to store the values that you need and set the values in the UI - when wolfpack boots an instance of your config class is rehydrated from the json config file and injected into the associated health check so you will have access to those required config properties inside the check. \r<br />\n<br />\nThe best mechanism to forward those config values into the notification is to use the notification &quot;properties&quot; collection - this just a name/value bag. There is also a Tags property on the notification - you could tag the notification with the values that way. Either way the values are persisted in the database (SQL, mongo etc) so you can find them later. \r<br />\n<br />\nHTH!\r<br />\n<br />\nJames<br />\n",
    "PostedDate": "2014-10-04T04:48:43.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1310452",
    "ThreadId": "568992",
    "Html": "Thanks James,\r<br />\n<br />\nI originally tried adding addition properties to the ISupportNotification, but the json for Data became very messy. If the config were created from the UI, it failed to load in the code, and if hand edited to load in code, the UI javascript failed to deserialize. And, every healthcheck needed minor mods.\r<br />\n<br />\nInstead, I had good luck adding new properties into the .config files in the RequireProperties section, so that all existing health checks can leverage this without changes to their code or classes.   Late last night, I worked out how to find them via ConfigurationManager, and so then HealthCheckBase can obtain them and add them to the notification request. \r<br />\n<br />\nI will likely keep this approach, and show you what I have when it's cleaned up a somewhat. Update you Monday or Tuesday!<br />\n",
    "PostedDate": "2014-10-04T05:23:44.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]